#+OPTIONS:    H:3 num:nil toc:1 \n:nil @:t ::t |:t ^:{} -:t f:t *:t TeX:t LaTeX:t skip:nil d:(HIDE) tags:not-in-toc
#+STARTUP:    align fold nodlcheck hidestars oddeven lognotestate hideblocks
#+SEQ_TODO:   TODO(t) INPROGRESS(i) WAITING(w@) | DONE(d) CANCELED(c@)
#+TAGS:       Write(w) Update(u) Fix(f) Check(c) 
#+TITLE:      Org-babel Uses
#+AUTHOR:     Thomas S. Dye
#+EMAIL:      tsd at tsdye dot com
#+LANGUAGE:   en
#+STYLE:      <style type="text/css">#outline-container-introduction{ clear:both; }</style>

*** Analysis
    The code blocks in this section will be repeatable as they rely on
    the fake data given above.

    *Ruby* calculate mean and standard deviation over the second column
#+srcname: stddev
#+begin_src ruby :var raw=example-data :results raw output :exports code
  by_procs = {}
  raw.each do |row|
    by_procs[row[1]] ||= []
    by_procs[row[1]] << row[3]
  end

  by_procs.each do |key, vals|
    mean = vals.inject(0){|sum, n| sum + n} / vals.size
    stddev = Math.sqrt(vals.inject(0){|sum, n| sum + ((n - mean).abs * (n - mean).abs)} / vals.size)
    puts "| #{key} | #{mean} | #{stddev} |"
  end
#+end_src

#+results: example-stddev
| 1 |       64.1517638 | 75.1190856698136 |
| 2 | 14.8874693333333 | 18.2514689828405 |
| 3 |       17.6483815 | 14.9070317402304 |
| 4 | 43.0102596666667 | 42.1863032424348 |

    *R* find the curve that best fits these data
#+begin_src R :session R :exports code :var data=example-stddev :results output
  procs <- data$V1
  times <- data$V2
  df <- data.frame(procs, times)
  nlsfit <- nls(times~c0 + (load/procs), data=df, start=list(load = 100, c0 = 20))
  summary(nlsfit)
#+end_src

#+results:
#+begin_example
Formula: times ~ c0 + (load/procs)

Parameters:
     Estimate Std. Error t value Pr(>|t|)
load    45.70      36.71   1.245    0.339
c0      11.12      21.90   0.508    0.662

Residual standard error: 21.36 on 2 degrees of freedom

Number of iterations to convergence: 1 
Achieved convergence tolerance: 3.924e-08
#+end_example

    *gnuplot* plot the raw data, along with the error bars and the best
    fit curve
#+begin_src gnuplot :var data=example-data :var mydata=example-stddev :exports code
  set xrange [0.5:5]
  set yrange [0:]
  set ylabel "seconds"
  set xlabel "processes"
  plot data using 2:4 with points title 'raw' linecolor 8
  replot mydata using 1:2:3 with errorbars title 'error' linecolor 1
  replot 11.12 + 45.70/x title 'fit'
#+end_src

    Which produces the following [[file:example-graph.pdf]]

